{"translation-revision-date":"YEAR-MO-DA HO:MI+ZONE","generator":"WP-CLI\/2.11.0","source":"build\/settings-page\/index.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"en","plural-forms":"nplurals=2; plural=(n != 1);"},"%d character":["%d znak","%d znaki\/ów"],"special character(s)":[""],"%d unique (non-repeated) character":[""],"%d consecutive symbol":[""],"\"%1$s\" is not within the accepted range (%2$d-%3$d).":[""],"\"%1$s\" must be greater than or equal to %2$d.":[""],"Our other WordPress plugins":["Nasze wtyczki do WordPressa"],"Help & support":[""],"Write a review":[""],"If you like this plugin, share it with your network and write a review on WordPress.org to help others find it. Thank you!":[""],"Share your feedback":[""],"We're eager to hear your feedback, feature requests, suggestions for improvements etc; we're waiting for a message from you!":[""],"Contact us":[""],"Settings saved":[""],"Settings were not saved, something went wrong.":[""],"Settings were not saved due to validation error: %s Please update the invalid field value and try again.":[""],"Saving…":[""],"Save all settings":[""],"Loading…":[""],"Settings fetch failed.":[""],"Please try again; if the issue will be repeating, reach out to our support team.":[""],"Buy the PRO version":["Kup wersję PRO"],"uppercase letter(s)":[""],"lowercase letter(s)":["mała litera\/y"],"base digit(s) (0 through 9)":[""],"%1$sallow up to %2$s from the user's name or display name":[""],"and to ":[""],"Currently, all complexity rules for this password policy are disabled.":[""],"Currently set to require: %s.":[""],"Policy":[""],"Inactive Policy":[""],"General settings":[""],"Activate this policy":[""],"You can deactivate any policy if you want to keep its settings but don't want to enforce it for users.":[""],"Policy name":[""],"We suggest using a descriptive name.":[""],"Enabled rules":[""],"Enforce the minimum password length":[""],"Once enabled, the users' password length must equal or exceed the defined value (currently set to %s).":[""],"Enforce the minimum password age":[""],"Once enabled, users can only change their passwords if the current password has been used for at least a defined period (currently set to %s).":[""],"%d day":[""],"Enforce the maximum password age":[""],"Once enabled, users will have to change their passwords if the current password has been in use for a defined period (currently set to %s).":[""],"Enforce the password complexity requirements":[""],"Once enabled, users' password must meet the complexity requirements. %s":[""],"Rule settings":[""],"Minimum password length":[""],"Number of characters required in passwords; a valid value should be between 1 and 50.":[""],"Minimum password age":[""],"Number of days; a valid value should be between 1 and 1000.":[""],"Maximum password age":[""],"Password complexity requirements":[""],"Uppercase letter(s) required":[""],"Lowercase letter(s) required":[""],"Base digit(s) (0 through 9) required":[""],"At least %s required":[""],"Up to %s from the user's name or display name allowed":[""],"Special character(s) required":[""],"Special character: one of punctuation characters that are present on standard US keyboard. See: <a>Password Special Characters<\/a> for more details.":[""],"Minimum number of unique (non-repeated) characters in password":[""],"Example: in the \"aabc\" password, three characters are unique (non-repeated); a valid value should be between 1 and 50.":[""],"Number of consecutive symbols of the user's name or display name allowed in the password":[""],"A valid value should be between 0 and 50. Examples: if \"0\" is chosen, all characters used in user name or display name will not be allowed in user's password; if \"2\" is chosen and user name is \"Bart\", password can contain \"ba\", \"ar\", and \"rt\", but not \"bar\" or \"art\".":[""],"Manage password policy":[""],"Password Reset Enforcement":[""],"Force users to reset their WordPress passwords. Execute for all users at once, by role, or only for specific users.":[""],"Create unlimited password policies":["Utwórz nieograniczoną liczbę zasad dotyczących polityki haseł"],"Apply password policies to specific users (by role or by user)":["Zastosuj zasady dotyczące haseł wobec określonych użytkowników (według roli lub użytkownika)"],"Prevent passwords reuse":["Zapobiegaj ponownemu wykorzystaniu haseł"],"Full integration with WooCommerce":["Pełna integracja z WooCommerce"],"Get access to PRO updates and our premium support":["Uzyskaj dostęp do aktualizacji PRO i naszego wsparcia premium"]}}}